//-------------------------------------------------------------------
// 
//
//
//-------------------------------------------------------------------

#include "stdafx.h"
#include "../include/NullAudioBuffer.h"

namespace Ogre
{
	namespace FKAudio
	{
		//-------------------------------------------------------------------
		NullAudioBuffer::~NullAudioBuffer()
		{
		
		}
		//-------------------------------------------------------------------
		// 播放控制函数：播放本音频缓冲区内信息
		void NullAudioBuffer::Play(bool bLoop)
		{
		
		}
		//-------------------------------------------------------------------
		// 播放控制函数：复位本音频缓冲区内信息
		void NullAudioBuffer::Reset()
		{
		
		}
		//-------------------------------------------------------------------
		// 播放控制函数：停止播放本音频缓冲区内信息
		void NullAudioBuffer::Stop()
		{
		}
		//-------------------------------------------------------------------
		// 状态获取函数：是否在播放
		bool NullAudioBuffer::IsPlaying() const
		{
			return false;
		}
		//-------------------------------------------------------------------
		// 状态获取函数：是否是声音文件
		bool NullAudioBuffer::IsSound() const
		{
			return true;
		}
		//-------------------------------------------------------------------
		// 状态获取函数：获取声音位置
		Vector3f NullAudioBuffer::GetPlayerPos() const
		{
			return Vector3f(0.0f, 0.0f, 0.0f);
		}
		//-------------------------------------------------------------------
		// 状态获取函数：获取声音速度
		Vector3f NullAudioBuffer::GetVelocity() const
		{
			return Vector3f(0.0f, 0.0f, 0.0f);
		}
		//-------------------------------------------------------------------
		// 状态获取函数：获取声音方向
		Vector3f NullAudioBuffer::GetDirection() const
		{
			return Vector3f(0.0f, 0.0f, 0.0f);
		}
		//-------------------------------------------------------------------
		// 属性设置函数：设置音量
		void NullAudioBuffer::SetVolume(float fVolume)
		{
		
		}
		//-------------------------------------------------------------------
		// 属性设置函数：设置播放位置
		void NullAudioBuffer::SetPlayerPos(const Vector3f& Pos)
		{
		
		}
		//-------------------------------------------------------------------
		// 属性设置函数：设置声音速度
		void NullAudioBuffer::SetVelocity(const Vector3f& Pos)
		{
		
		}
		//-------------------------------------------------------------------
		// 属性设置函数：设置声音方向
		void NullAudioBuffer::SetDirection(const Vector3f& Pos)
		{
		
		}
		//-------------------------------------------------------------------
	}
}